def correlate(X, Y):
    return ((len(X) * sum(map(lambda z: z[0] * z[1], zip(X, Y))) - sum(X) * sum(Y)) /
            ((len(X) * sum(map(lambda x: x ** 2, X)) - sum(X) ** 2) *
             (len(Y) * sum(map(lambda y: y ** 2, Y)) - sum(Y) ** 2)) ** 0.5)


lst1 = [19, 32, 33, 44, 28, 35, 39, 39, 44, 44, 24, 37, 29, 40, 42, 32, 48, 42, 33, 47]
lst2 = [17, 7, 17, 28, 27, 31, 20, 17, 35, 43, 10, 28, 13, 43, 45, 24, 45, 26, 16, 26]
lst3 = [24, 27, 26, 21, 20, 31, 26, 22, 20, 18, 30, 29, 24, 26]
lst4 = [100, 115, 117, 119, 134, 94, 105, 103, 111, 124, 122, 109, 110, 86]

cor = (correlate(lst1, lst2))  # должно получиться
print(f'Результат: {cor} Это верный ответ? - {cor == 0.6692438094742086}')

cor = correlate(lst3, lst4)
print(f'Результат: {cor} Это верный ответ? - {cor == -0.42109242545908376}')

